//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================

//#define WIN32_LEAN_AND_MEAN

#include <windows.h>
#include "wx_command_line.h"

namespace wx {

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
CommandLine::CommandLine()
	: m_argv(NULL)
	, m_argc(0)
{
	m_argv = CommandLineToArgvW(GetCommandLineW(), &m_argc);
}

//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
CommandLine::~CommandLine()
{
	if (m_argv) {
		LocalFree(m_argv);
	}

	m_argv = NULL;
}

//-----------------------------------------------------------------------------
// プログラム名を除く引数の数を取得する
//-----------------------------------------------------------------------------
int CommandLine::GetArgc() const
{
	return (m_argc > 0)? (m_argc - 1) : 0;
}

//-----------------------------------------------------------------------------
// プログラム名を除く引数を取得する
//-----------------------------------------------------------------------------
const wchar_t* CommandLine::GetArgv(int pos) const
{
	return (m_argv && pos >= 0 && pos < (m_argc - 1))? m_argv[pos + 1] : NULL;
}

//-----------------------------------------------------------------------------
// プログラム名引数を取得する
//-----------------------------------------------------------------------------
const wchar_t* CommandLine::GetExeName() const
{
	return m_argv? m_argv[0] : NULL;
}

} //namespace wx
