//=============================================================================
// Auxiliary library for Windows API (C++)
//                                                     Copyright (c) 2007 MAYO.
//=============================================================================
#pragma once

namespace wx {

//-----------------------------------------------------------------------------
//! @class	TaskTray
//! @brief	通知領域
//-----------------------------------------------------------------------------
class TaskTray
{
public:
	//-------------------------------------------------------------------------
	//! @brief	コンストラクタ
	//-------------------------------------------------------------------------
	TaskTray();

	//-------------------------------------------------------------------------
	//! @brief	デストラクタ
	//-------------------------------------------------------------------------
	~TaskTray();

	//-------------------------------------------------------------------------
	//! @brief	タスクバー再起動のメッセージを登録
	//!
	//! @return	タスクバー再起動のメッセージID
	//-------------------------------------------------------------------------
	static UINT RegisterTaskbarMessage();

	//-------------------------------------------------------------------------
	//! @brief	通知領域アイコンを設定する
	//!
	//! @param	hwnd		アイコンを管理するウィンドウ、通知にも利用
	//! @param	id			識別ID
	//! @param	tip			マウスカーソルを持っていったときに出る文字
	//! @param	icon		表示するアイコン(16x16)
	//! @param	msg			通知をするときのメッセージID
	//!
	//! @retval	true		設定できた
	//! @retval	false		設定できなかった
	//-------------------------------------------------------------------------
	bool Initialize(HWND hwnd, UINT id, PCTSTR tip, HICON icon, UINT msg);

	//-------------------------------------------------------------------------
	//! @brief	通知領域アイコンを消す
	//-------------------------------------------------------------------------
	void Finalize();

	//-------------------------------------------------------------------------
	//! @brief	通知領域アイコンを再設定する
	//!
	//! @param	tip			マウスカーソルを持っていったときに出る文字
	//! @param	icon		表示するアイコン(16x16)
	//! @param	msg			通知をするときのメッセージID
	//!
	//! @retval	true		設定できた
	//! @retval	false		設定できなかった
	//-------------------------------------------------------------------------
	bool Reset(PCTSTR tip, HICON icon, UINT msg);

	//-------------------------------------------------------------------------
	//! @brief	バルーンを表示
	//!
	//! @param	title		タイトル
	//! @param	message		メッセージ
	//! @param	timeout		タイムアウト時間、ミリ秒
	//!
	//! @retval	true		バルーンを表示した
	//! @retval	false		バルーンを表示できなかった
	//-------------------------------------------------------------------------
	bool ShowInfo(PCTSTR title, PCTSTR message, UINT timeout);

	//-------------------------------------------------------------------------
	//! @brief	バルーンを消す
	//-------------------------------------------------------------------------
	void HideInfo();

private:
	HWND	m_hwnd;
	UINT	m_id;
};

} //namespace wx
